# 필수과제1
- 시리즈 형태 문법을 직접 작성해서 값이 어떻게 나오는지 확인
- 구글링을 통해 위의 문법 외에 최소 3개 이상 정도 검색해서 해당 문법 설명과 코드 작성해서 표현하기

In [5]:
import pandas as pd
import random

test = pd.read_csv('gapminder.tsv', sep='\t')
test

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [6]:
test_df = test['pop']

In [7]:
test_df.mean()

29601212.324530516

In [10]:
# describe
test_df.describe()

count    1.704000e+03
mean     2.960121e+07
std      1.061579e+08
min      6.001100e+04
25%      2.793664e+06
50%      7.023596e+06
75%      1.958522e+07
max      1.318683e+09
Name: pop, dtype: float64

In [11]:
# drop_duplicates
test_df.drop_duplicates()

0        8425333
1        9240934
2       10267083
3       11537966
4       13079460
          ...
1699     9216418
1700    10704340
1701    11404948
1702    11926563
1703    12311143
Name: pop, Length: 1704, dtype: int64

In [21]:
# sort_values
print(test_df.sort_values())
print(test_df.sort_values(ascending=False))

1296         60011
1297         61325
420          63149
1298         65345
1299         70787
           ...
707     1110396331
296     1164970000
297     1230075000
298     1280400000
299     1318683096
Name: pop, Length: 1704, dtype: int64
299     1318683096
298     1280400000
297     1230075000
296     1164970000
707     1110396331
           ...
1299         70787
1298         65345
420          63149
1297         61325
1296         60011
Name: pop, Length: 1704, dtype: int64

In [19]:
# loc 과 iloc 사용
print(test_df.sort_values().loc[0])
print(test_df.sort_values().iloc[0])

8425333
60011

In [22]:
# to_frame
test_df.to_frame(name='numbers')

       numbers
0      8425333
1      9240934
2     10267083
3     11537966
4     13079460
...        ...
1699   9216418
1700  10704340
1701  11404948
1702  11926563
1703  12311143

[1704 rows x 1 columns]

In [24]:
# reindex -> 전달 값으로 인덱스 변경, 기존 인덱스 그대로 사용, 새로운 인덱스에 결측치 값으로 채움
test_df.reindex()

0        8425333
1        9240934
2       10267083
3       11537966
4       13079460
          ...
1699     9216418
1700    10704340
1701    11404948
1702    11926563
1703    12311143
Name: pop, Length: 1704, dtype: int64

In [25]:
# idxmax -> 최솟값, 최댓값 인덱스 반환
test_df.idxmax()

299

In [26]:
# unique -> 중복 제거
test_df.unique()

array([ 8425333,  9240934, 10267083, ..., 11404948, 11926563, 12311143],
      dtype=int64)